Тестовая_база_ERP_14/src/Documents/РЭЙ_СправкаОПодтверждающихДокументах/РЭЙ_СправкаОПодтверждающихДокументах.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РЭЙ_СправкаОПодтверждающихДокументах</name>
  <basedOn>Document.РЭЙ_СправкаОПодтверждающихДокументах</basedOn>
  <registerRecords>InformationRegister.РЭЙ_СправкиВалютногоКонтроля</registerRecords>
  <attributes>
    <name>Банк</name>
    <type>
      <types>CatalogRef.КлассификаторБанков</types>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГлавныйБухгалтер</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаКон</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНач</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Импорт</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>Любая дополнительная информация</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтрактВЭД</name>
    <type>
      <types>CatalogRef.РЭЙ_КонтрактыВЭД</types>
    </type>
  </attributes>
  <attributes>
    <name>Корректировка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерКорректировки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.РЭЙ_СправкаОПодтверждающихДокументах</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ПаспортСделки</name>
    <type>
      <types>DocumentRef.РЭЙ_ПаспортСделки</types>
    </type>
  </attributes>
  <attributes>
    <name>Первичное</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РазрешениеЦБ</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>Руководитель</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>РучноеЗаполнение</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТелефонУполномоченногоВК</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТолькоПоГТД</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УполномоченныйВК</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ФТСПередалаГТДвЦБР</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Экспорт</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ПодтверждающиеДокументы</name>
    <attributes>
      <name>ВалютаДокумента</name>
      <type>
        <types>CatalogRef.Валюты</types>
      </type>
    </attributes>
    <attributes>
      <name>ВалютаКонтракта</name>
      <type>
        <types>CatalogRef.Валюты</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидДокумента</name>
      <type>
        <types>CatalogRef.РЭЙ_ВидыПодтверждающихДокументов</types>
      </type>
    </attributes>
    <attributes>
      <name>ГТДПоИмпорту</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаШтампаТаможни</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Документ</name>
      <type>
        <types>DocumentRef.ВозвратТоваровОтКлиента</types>
        <types>DocumentRef.ПриобретениеТоваровУслуг</types>
        <types>DocumentRef.ТаможеннаяДекларацияИмпорт</types>
        <types>DocumentRef.ВозвратТоваровПоставщику</types>
        <types>DocumentRef.РеализацияУслугПрочихАктивов</types>
        <types>DocumentRef.РеализацияТоваровУслуг</types>
        <types>DocumentRef.ПриобретениеУслугПрочихАктивов</types>
        <types>DocumentRef.АктВыполненныхРабот</types>
      </type>
    </attributes>
    <attributes>
      <name>ДопСоглашение</name>
      <type>
        <types>CatalogRef.ДоговорыКонтрагентов</types>
      </type>
    </attributes>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>Корректировка</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерГТД</name>
      <type>
        <types>CatalogRef.НомераГТД</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерСтрокиДляПечати</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОжидаемыйСрок</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПризнакПоставки</name>
      <type>
        <types>EnumRef.РЭЙ_ПризнакиПоставки</types>
      </type>
    </attributes>
    <attributes>
      <name>Примечание</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>СтранаГрузоотправителяГрузополучателя</name>
      <type>
        <types>CatalogRef.СтраныМира</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаАвансаВВалютеДокумента</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаАвансаВВалютеКонтракта</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаВВалютеДокумента</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаВВалютеКонтракта</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Удалить_АвансоваяСправка</name>
      <type>
        <types>DocumentRef.РЭЙ_СправкаОВалютныхОперациях</types>
      </type>
    </attributes>
    <attributes>
      <name>Удалить_АвансовыйРасчетныйДокумент</name>
      <type>
        <types>DocumentRef.СписаниеБезналичныхДенежныхСредств</types>
        <types>DocumentRef.ПоступлениеБезналичныхДенежныхСредств</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПодтверждающиеДокументыРучные</name>
    <attributes>
      <name>ВалютаДокумента</name>
      <type>
        <types>CatalogRef.Валюты</types>
      </type>
    </attributes>
    <attributes>
      <name>ВалютаКонтракта</name>
      <type>
        <types>CatalogRef.Валюты</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидДокумента</name>
      <type>
        <types>CatalogRef.РЭЙ_ВидыПодтверждающихДокументов</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаШтампаТаможни</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДопСоглашение</name>
      <type>
        <types>CatalogRef.ДоговорыКонтрагентов</types>
      </type>
    </attributes>
    <attributes>
      <name>Корректировка</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерГТД</name>
      <type>
        <types>CatalogRef.НомераГТД</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерНакладной</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерСтрокиДляПечати</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОжидаемыйСрок</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПризнакПоставки</name>
      <type>
        <types>EnumRef.РЭЙ_ПризнакиПоставки</types>
      </type>
    </attributes>
    <attributes>
      <name>Примечание</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>СтранаГрузоотправителяГрузополучателя</name>
      <type>
        <types>CatalogRef.СтраныМира</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаАвансаВВалютеДокумента</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаАвансаВВалютеКонтракта</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаВВалютеДокумента</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаВВалютеКонтракта</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Авансы</name>
    <attributes>
      <name>АвансоваяСправка</name>
      <type>
        <types>DocumentRef.РЭЙ_СправкаОВалютныхОперациях</types>
      </type>
    </attributes>
    <attributes>
      <name>АвансовыйРасчетныйДокумент</name>
      <type>
        <types>DocumentRef.СписаниеБезналичныхДенежныхСредств</types>
        <types>DocumentRef.ПоступлениеБезналичныхДенежныхСредств</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаАвансаВВалютеКонтракта</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Тестовая_база_ERP_14/src/Documents/РЭЙ_СправкаОПодтверждающихДокументах/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм,ОбъектыПечати, ПараметрыВывода) Экспорт
	
	ПараметрыВывода.ДоступнаПечатьПоКомплектно = Истина;

	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "СправкаОПодтверждающихДокументах_2018") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм,
		"СправкаОПодтверждающихДокументах_2018",
		"Справка о подтверждающих документах",
		ПолучитьТабДок_2018(МассивОбъектов));
	КонецЕсли;

	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "СправкаОПодтверждающихДокументах") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм,
		"СправкаОПодтверждающихДокументах",
		"Справка о подтверждающих документах (до 01.03.2018)",
		ПолучитьТабДок_2015(МассивОбъектов));
	КонецЕсли;
КонецПроцедуры	
	
Функция ПолучитьТабДок_2018(МассивОбъектов)
	ТабличныйДокумент	= Новый ТабличныйДокумент;
	
	ПервыйДокумент = Истина;
	Для Каждого Ссылка Из МассивОбъектов Цикл
		Если Не ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		Иначе
			ПервыйДокумент = Ложь;
		КонецЕсли;
		
		ОбъектСсылки = Ссылка.ПолучитьОбъект();	
		ТабличныйДокумент.Вывести(ОбъектСсылки.ПечатьСПД_2018());
	КонецЦикла;
	
	ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	ТабличныйДокумент.АвтоМасштаб = Истина;
	
	Возврат ТабличныйДокумент;
КонецФункции	
	
Функция ПолучитьТабДок_2015(МассивОбъектов)
	ТабличныйДокумент	= Новый ТабличныйДокумент;
	
	ПервыйДокумент = Истина;
	Для Каждого Ссылка Из МассивОбъектов Цикл
		Если Не ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		Иначе
			ПервыйДокумент = Ложь;
		КонецЕсли;
		
		ОбъектСсылки = Ссылка.ПолучитьОбъект();	
		
		Если Ссылка.Дата >= Дата(2015,12,28) Тогда
			ТабличныйДокумент.Вывести(ОбъектСсылки.ПечатьСПД_2015());
		Иначе
			ТабличныйДокумент.Вывести(ПечатьСПД_2012(Ссылка));
		КонецЕсли;
	КонецЦикла;
	
	ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	ТабличныйДокумент.АвтоМасштаб = Истина;
	
	Возврат ТабличныйДокумент;
КонецФункции	

Функция ПечатьСПД_2012(СсылкаНаОбъект)
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_СправкаОПодтверждающихДокументах";
	Макет = Документы.РЭЙ_СправкаОПодтверждающихДокументах.ПолучитьМакет("СправкаОПодтверждающихДокументах");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СправкаОПодтверждающихДокументах.ПаспортСделки.НомерПаспортаСделки КАК НомерПаспортаСделки,
	|	СправкаОПодтверждающихДокументах.Контрагент КАК Контрагент,
	|	СправкаОПодтверждающихДокументах.КонтрактВЭД КАК КонтрактВЭД,
	|	СправкаОПодтверждающихДокументах.Банк КАК Банк,
	|	СправкаОПодтверждающихДокументах.Организация,
	|	СправкаОПодтверждающихДокументах.Дата,
	|	СправкаОПодтверждающихДокументах.Руководитель,
	|	СправкаОПодтверждающихДокументах.ГлавныйБухгалтер,
	|	СправкаОПодтверждающихДокументах.РучноеЗаполнение,
	|	СправкаОПодтверждающихДокументах.Корректировка,
	|	СправкаОПодтверждающихДокументах.Основание
	|ИЗ
	|	Документ.РЭЙ_СправкаОПодтверждающихДокументах КАК СправкаОПодтверждающихДокументах
	|ГДЕ
	|	СправкаОПодтверждающихДокументах.Ссылка = &Ссылка";

	Запрос.УстановитьПараметр("Ссылка", СсылкаНаОбъект);

	Результат = Запрос.Выполнить();
	ДанныеДляПечатиШапки = Результат.Выбрать();
	ДанныеДляПечатиШапки.Следующий();
	
	// рк+ 26.02.09
	Если НЕ ЗначениеЗаполнено(ДанныеДляПечатиШапки.Банк.РЭЙ_НаименованиеПолное) Тогда
	   	 Сообщить("Печать справки невозможна, т.к. не заполнено полное наименование уполномоченного банка "+ДанныеДляПечатиШапки.Банк);
		 Возврат Неопределено;
	КонецЕсли; 
	//рк- 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТЧ.НомерСтрокиДляПечати КАК НомерСтрокиДляПечати,
	|	ТЧ.НомерСтроки КАК НомерСтроки,
	|	ТЧ.СуммаВВалютеКонтракта КАК СуммаВВалютеКонтракта,
	|	ТЧ.СуммаВВалютеДокумента КАК СуммаВВалютеДокумента,
	|	ТЧ.СуммаАвансаВВалютеКонтракта КАК СуммаАвансаВВалютеКонтракта,
	|	ТЧ.СуммаАвансаВВалютеДокумента КАК СуммаАвансаВВалютеДокумента
	|ИЗ
	|	Документ.РЭЙ_СправкаОПодтверждающихДокументах.ПодтверждающиеДокументы КАК ТЧ
	|ГДЕ
	|	ТЧ.Ссылка = &Ссылка
	|	И (ТЧ.Ссылка.Первичное
	|			ИЛИ ТЧ.Ссылка.Корректировка
	|				И ТЧ.Корректировка)
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтрокиДляПечати,
	|	НомерСтроки
	|ИТОГИ
	|	СУММА(СуммаВВалютеКонтракта),
	|	СУММА(СуммаВВалютеДокумента),
	|	СУММА(СуммаАвансаВВалютеКонтракта),
	|	СУММА(СуммаАвансаВВалютеДокумента)
	|ПО
	|	НомерСтрокиДляПечати";
	
	Если СсылкаНаОбъект.РучноеЗаполнение Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "Документ.РЭЙ_СправкаОПодтверждающихДокументах.ПодтверждающиеДокументы", "Документ.РЭЙ_СправкаОПодтверждающихДокументах.ПодтверждающиеДокументыРучные");
	КонецЕсли;
	Запрос.УстановитьПараметр("Ссылка", СсылкаНаОбъект);

	Результат = Запрос.Выполнить();
	ВыборкаИтоги = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	
	//+ШАПКА1
	Область = Макет.ПолучитьОбласть("Шапка1");
	Область.Параметры.Банк = ДанныеДляПечатиШапки.Банк.РЭЙ_НаименованиеПолное;
	Если ЗначениеЗаполнено(ДанныеДляПечатиШапки.Организация) Тогда
		Область.Параметры.ОрганизацияНаименование = ?(ПустаяСтрока(ДанныеДляПечатиШапки.Организация.НаименованиеПолное),?(ПустаяСтрока(ДанныеДляПечатиШапки.Организация.НаименованиеПолное),ДанныеДляПечатиШапки.Организация.Наименование,ДанныеДляПечатиШапки.Организация.НаименованиеПолное),ДанныеДляПечатиШапки.Организация.НаименованиеПолное);
	КонецЕсли;
	
	Если ДанныеДляПечатиШапки.Корректировка и ЗначениеЗаполнено(ДанныеДляПечатиШапки.Основание) Тогда
		Область.Параметры.Дата = Формат(ДанныеДляПечатиШапки.Основание.Дата, "ДФ=dd.MM.yyyy");
	Иначе
		Область.Параметры.Дата = Формат(ДанныеДляПечатиШапки.Дата, "ДФ=dd.MM.yyyy");
	КонецЕсли; 
	
	//вывод номера паспорта сделки
	Для счетчик = 1 По 22 Цикл
		Если (счетчик = 9) или (счетчик = 14) или (счетчик = 19) или (счетчик = 21) Тогда
			//ОбластьЛист1.Параметры["НПС_"+счетчик] = "/";
		Иначе 
			Область.Параметры["НПС_"+счетчик] = Сред(ДанныеДляПечатиШапки.НомерПаспортаСделки, счетчик ,1);
		КонецЕсли; 
	КонецЦикла; 
	
	Если ДанныеДляПечатиШапки.Корректировка Тогда
		Область.Параметры.Корректировка = "*";	
	КонецЕсли;
	
	ТабДокумент.Вывести(Область);
	//-ШАПКА1
	
	ТабличныйДокументПримечания = Новый ТабличныйДокумент;
	
	//+СТРОКА1
	Если ВыборкаИтоги.Количество() = 0 Тогда
		Область = Макет.ПолучитьОбласть("Строка1");
		ТабДокумент.Вывести(Область);
	Иначе
		Область = Макет.ПолучитьОбласть("Строка1");

		Пока ВыборкаИтоги.Следующий() Цикл
			ВыборкаСтроки = ВыборкаИтоги.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			ВыборкаСтроки.Следующий();
			
			Если Не СсылкаНаОбъект.РучноеЗаполнение Тогда
				ИмяТЧ = "ПодтверждающиеДокументы";
				СтрокаТЧ = СсылкаНаОбъект[ИмяТЧ][ВыборкаСтроки.НомерСтроки - 1];
				текДокумент = СтрокаТЧ.Документ;
			Иначе
				ИмяТЧ = "ПодтверждающиеДокументыРучные";
				СтрокаТЧ = СсылкаНаОбъект[ИмяТЧ][ВыборкаСтроки.НомерСтроки - 1];
				текДокумент = Неопределено;
			КонецЕсли;
			
			Область.Параметры.НомерСтроки = ВыборкаИтоги.НомерСтрокиДляПечати;
			Область.Параметры.ДокументНомер = РЭЙ_СлужебныйСервер.ПолучитьНомерПодтверждающегоДокумента(СтрокаТЧ, СсылкаНаОбъект.РучноеЗаполнение);
			Если СсылкаНаОбъект.Дата >= Дата("20131001") И ЗначениеЗаполнено(СтрокаТЧ.НомерГТД) Тогда
				Область.Параметры.Дата = "";
			Иначе
				Область.Параметры.Дата = Формат(РЭЙ_СлужебныйСервер.ПолучитьДатуПодтверждающегоДокумента(СтрокаТЧ, СсылкаНаОбъект.РучноеЗаполнение), "ДФ=dd.MM.yyyy");
			КонецЕсли;
			Область.Параметры.ВидДокумента = СтрокаТЧ.ВидДокумента.Код; 
			Область.Параметры.КодВалДок = СтрокаТЧ.ВалютаДокумента.Код;
			Если ВыборкаИтоги.СуммаАвансаВВалютеДокумента = 0 Тогда
				Область.Параметры.СуммаВалДок = Формат(ВыборкаИтоги.СуммаВВалютеДокумента, "ЧДЦ=2");
				Область.Параметры.СуммаКонтракт = Формат(ВыборкаИтоги.СуммаВВалютеКонтракта, "ЧДЦ=2");
			Иначе
				Если ЗначениеЗаполнено(СтрокаТЧ.НомерГТД) Тогда
					ПоляПоиска = "НомерГТД"; 
				Иначе
					Если Не СсылкаНаОбъект.РучноеЗаполнение Тогда
						ПоляПоиска = "Документ";
					Иначе
						Если ЗначениеЗаполнено(СтрокаТЧ.НомерНакладной) Тогда
							ПоляПоиска = "НомерНакладной";
						Иначе
							ПоляПоиска = "";
							СуммаДокументаВВалютеДокумента = 0;
							СуммаДокументаВВалютеКонтракта = 0;
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
				Если Не ПустаяСтрока(ПоляПоиска) Тогда
					СтруктураПоиска = Новый Структура(ПоляПоиска);
					ЗаполнитьЗначенияСвойств(СтруктураПоиска, СтрокаТЧ);
					СтрокиДляСуммирования = СсылкаНаОбъект[ИмяТЧ].НайтиСтроки(СтруктураПоиска);
					ТаблицаДляСуммирования = СсылкаНаОбъект[ИмяТЧ].Выгрузить(СтрокиДляСуммирования);
					СуммаДокументаВВалютеДокумента = ТаблицаДляСуммирования.Итог("СуммаВВалютеДокумента");
					СуммаДокументаВВалютеКонтракта = ТаблицаДляСуммирования.Итог("СуммаВВалютеКонтракта");
				КонецЕсли;
				Если СуммаДокументаВВалютеДокумента = ВыборкаИтоги.СуммаАвансаВВалютеДокумента Тогда
					Область.Параметры.СуммаВалДок = Формат(ВыборкаИтоги.СуммаАвансаВВалютеДокумента, "ЧДЦ=2");
				Иначе	
					Область.Параметры.СуммаВалДок = Формат(СуммаДокументаВВалютеДокумента, "ЧДЦ=2") + ?(ВыборкаИтоги.СуммаАвансаВВалютеДокумента = 0, "", "/" + Формат(ВыборкаИтоги.СуммаАвансаВВалютеДокумента, "ЧДЦ=2"));
				КонецЕсли;
				Если СуммаДокументаВВалютеКонтракта = ВыборкаИтоги.СуммаАвансаВВалютеКонтракта Тогда
					Область.Параметры.СуммаКонтракт = Формат(ВыборкаИтоги.СуммаАвансаВВалютеКонтракта, "ЧДЦ=2");
				Иначе	
					Область.Параметры.СуммаКонтракт = Формат(СуммаДокументаВВалютеКонтракта, "ЧДЦ=2") + ?(ВыборкаИтоги.СуммаАвансаВВалютеДокумента = 0, "", "/" + Формат(ВыборкаИтоги.СуммаАвансаВВалютеКонтракта, "ЧДЦ=2"));
				КонецЕсли;
			КонецЕсли;
			Область.Параметры.КодВалКонтракт = СтрокаТЧ.ВалютаКонтракта.Код;
			Область.Параметры.ПризнакПоставки = Сред("" + СтрокаТЧ.ПризнакПоставки, 1, 1);
			Область.Параметры.ОжидаемыйСрок = СтрокаТЧ.ОжидаемыйСрок;
			Область.Параметры.КодСтраныГрузоотправителя = СтрокаТЧ.СтранаГрузоотправителяГрузополучателя.Код;
			ТабДокумент.Вывести(Область);
			
			//С 01.10.2013, если в качестве номера подтверждающего документа указывается номер ГТД (случай товарного контракта), то при выводе на печать не надо заполнять Графу 3 (Дата подтверждающего документа) 
			Если СсылкаНаОбъект.Дата >= Дата("20131001") Тогда
				Если ЗначениеЗаполнено(СтрокаТЧ.НомерГТД) Тогда
					Область.Параметры.Дата = "";
				КонецЕсли;
			КонецЕсли;
			
			ВыборкаСтроки.Сбросить();
			ТекстПримечания = "";
			Пока ВыборкаСтроки.Следующий() Цикл
				СтрокаТЧ_Примечание = СсылкаНаОбъект[ИмяТЧ][ВыборкаСтроки.НомерСтроки - 1];
				Если Не ПустаяСтрока(СтрокаТЧ_Примечание.Примечание) Тогда
					ТекстПримечания = ТекстПримечания + ?(ТекстПримечания = "", "", "; ") + СокрЛП(СтрокаТЧ_Примечание.Примечание);
				КонецЕсли;
			КонецЦикла;
			Если Не ПустаяСтрока(ТекстПримечания) Тогда
				ОбластьПримечание = Макет.ПолучитьОбласть("Строка2");
				ОбластьПримечание.Параметры.НомерСтроки = ВыборкаИтоги.НомерСтрокиДляПечати;
				ОбластьПримечание.Параметры.Примечание = ТекстПримечания;
				ТабличныйДокументПримечания.Вывести(ОбластьПримечание);
			КонецЕсли;

			//------------------------------------------
			Если Не СсылкаНаОбъект.РучноеЗаполнение Тогда
				Если ЗначениеЗаполнено(ТекДокумент) Тогда
					Если СсылкаНаОбъект.Банк.РЭЙ_ВидПредоставленияДокументовПоСделке = 1 Тогда
						РЭЙ_ЗадачиСервер.УстановитьСтатусЗадачиВЭД(ТекДокумент, "Распечатана");
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	//-СТРОКА1
	
	
	//+ШАПКА2
	Область = Макет.ПолучитьОбласть("Шапка2");
	ТабДокумент.Вывести(Область);
	//-ШАПКА2
	
	//+СТРОКА2
	Если ВыборкаИтоги.Количество() = 0 Тогда
		Область = Макет.ПолучитьОбласть("Строка2");
		ТабДокумент.Вывести(Область);
	Иначе
		ТабДокумент.Вывести(ТабличныйДокументПримечания);
	КонецЕсли;
	//-СТРОКА2
	
	Область = Макет.ПолучитьОбласть("Подвал");
	Область.Параметры.ФИОРуководителя = РЭЙ_СлужебныйСервер.ПолучитьФИОФизлица(ДанныеДляПечатиШапки.Руководитель, ДанныеДляПечатиШапки.Дата);
	Область.Параметры.ФИОБухгалтера   = РЭЙ_СлужебныйСервер.ПолучитьФИОФизлица(ДанныеДляПечатиШапки.ГлавныйБухгалтер, ДанныеДляПечатиШапки.Дата);
	ТабДокумент.Вывести(Область);
	Возврат ТабДокумент;
	

КонецФункции // ПечатьСправкиОПодтверждающихДокументах2012()

Процедура ПолучитьСтруктуруПараметров(СсылкаНаДокумент, ИмяМакета, СтруктураПараметров) Экспорт
	СтруктураПараметров = СсылкаНаДокумент.ПолучитьОбъект().ПолучитьДанныеДляПечати();
КонецПроцедуры

#КонецЕсли

#Область ПроцедурыИФункцииПечати

Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Обработчик = "РЭЙ_СлужебныйКлиент.ВыполнитьКомандуПечати";
	КомандаПечати.МенеджерПечати = "Документ.РЭЙ_СправкаОПодтверждающихДокументах";
	КомандаПечати.Идентификатор = "СправкаОПодтверждающихДокументах_2018";
	КомандаПечати.Представление = НСтр("ru = 'Справка о подтверждающих документах'");
	КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
	КомандаПечати.Порядок = 10;
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Обработчик = "РЭЙ_СлужебныйКлиент.ВыполнитьКомандуПечати";
	КомандаПечати.МенеджерПечати = "Документ.РЭЙ_СправкаОПодтверждающихДокументах";
	КомандаПечати.Идентификатор = "СправкаОПодтверждающихДокументах";
	КомандаПечати.Представление = НСтр("ru = 'Справка о подтверждающих документах (до 01.03.2018)'");
	КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
	КомандаПечати.Порядок = 20;
КонецПроцедуры

#КонецОбласти
